ht32-holtek/HT32_STD_7xxxx_FWLib/library/HT32F7xxxx_Driver/src/ht32f7xxxx_pwrcu.c
/*********************************************************************************************************//**
 * @brief Configure the LDO operation mode.
 * @param Sel: Specify the LDO mode.
 *   This parameter can be one of the following values:
 *     @arg PWRCU_LDO_NORMAL     : The LDO is operated in normal current mode
 *     @arg PWRCU_LDO_LOWCURRENT : The LDO is operated in low current mode
 * @retval None
 ************************************************************************************************************/
void PWRCU_LDOConfig(PWRCU_LDOMODE_Enum Sel)
{
  u32 uRTCStatus = 0;

  /* Check the parameters                                                                                   */
  Assert_Param(IS_PWRCU_LDOMODE(Sel));

  uRTCStatus = Get_RTCEN;
  Set_RTCEN;

  if (Sel == PWRCU_LDO_NORMAL)
  {
    Reset_LDOMODE;
  }
  else
  {
    Set_LDOMODE;
  }

  if (uRTCStatus == 0)
  {
    Reset_RTCEN;
  }
}

/*********************************************************************************************************//**
 * @brief Enable or Disable the LVD interrupt wakeup function.
 * @param NewState: This parameter can be ENABLE or DISABLE.
 * @retval None
 ************************************************************************************************************/
void PWRCU_LVDIntWakeupConfig(ControlStatus NewState)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_CONTROL_STATUS(NewState));

  if (NewState != DISABLE)
  {
    Set_LVDIWEN;
  }
  else
  {
    Reset_LVDIWEN;
  }
}

/*********************************************************************************************************//**
 * @brief Enable or Disable the LVD event wakeup function.
 * @param NewState: This parameter can be ENABLE or DISABLE.
 * @retval None
 ************************************************************************************************************/
void PWRCU_LVDEventWakeupConfig(ControlStatus NewState)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_CONTROL_STATUS(NewState));

  if (NewState != DISABLE)
  {
    Set_LVDEWEN;
  }
  else
  {
    Reset_LVDEWEN;
  }
}

/*********************************************************************************************************//**
 * @brief Enable or Disable the external WAKEUP pin function.
 * @param NewState: This parameter can be ENABLE or DISABLE.
 * @retval None
 ************************************************************************************************************/
void PWRCU_WakeupPinCmd(ControlStatus NewState)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_CONTROL_STATUS(NewState));

  if (NewState != DISABLE)
  {
    Set_WUP0EN;
  }
  else
  {
    Reset_WUP0EN;
  }
}

/*********************************************************************************************************//**
 * @brief Configure the LDO output voltage level.
 * @param Level : The LDO default output voltage offset.
 *   This parameter can be one of the following values:
 *     @arg PWRCU_LDO_LEVEL0
 *     @arg PWRCU_LDO_LEVEL1
 *     @arg PWRCU_LDO_LEVEL2
 *     @arg PWRCU_LDO_LEVEL3
 * @retval None
 ************************************************************************************************************/
void PWRCU_LDOOutputVoltageConfig(PWRCU_LDO_LEVEL_TypeDef Level)
{
  u32 uTmpReg;
  uTmpReg = HT_PWRCU->CR & CR_LDO_LEVEL_Msk;
  uTmpReg |= (Level << CR_LDO_LEVEL_Pos);
  HT_PWRCU->CR = uTmpReg;
}

/*********************************************************************************************************//**
 * @brief Configure the ULDO(Ultra-low Power) output voltage level.
 * @param Level : The ULDO default output voltage offset.
 *   This parameter can be one of the following values:
 *     @arg PWRCU_ULDO_LEVEL0
 *     @arg PWRCU_ULDO_LEVEL1
 *     @arg PWRCU_ULDO_LEVEL2
 *     @arg PWRCU_ULDO_LEVEL3
* @retval None
 ************************************************************************************************************/
void PWRCU_ULDOOutputVoltageConfig(PWRCU_ULDO_LEVEL_TypeDef Level)
{
  u32 uTmpReg;
  uTmpReg = HT_PWRCU->CR & CR_ULDO_LEVEL_Msk;
  uTmpReg |= (Level << CR_ULDO_LEVEL_Pos);
  HT_PWRCU->CR = uTmpReg;
}

/*********************************************************************************************************//**
 * @brief Force the Ultra-low Power to turn off.
 * @retval None
 * @note !!! This bit ULDOOFF will be clear to 0 when the MCU is into the Power-Down or Deep Power-Down mode,
         VDD power domain reset.
 ************************************************************************************************************/
void PWRCU_ForceTurnOffULDO(void)
{
  Set_ULDOOFF;
}

/**
  * @}
  */


/**
  * @}
  */

/**
  * @}
  */
